---
kind: method
id: M:Autodesk.Revit.DB.ScheduleDefinition.ClearSortGroupFields
source: html/645645fa-52b8-b747-e3d4-b5428962a4bc.htm
---
# Autodesk.Revit.DB.ScheduleDefinition.ClearSortGroupFields Method

Removes all sorting/grouping fields.

## Syntax (C#)
```csharp
public void ClearSortGroupFields()
```